struct xss
    κ
    φ::Polynomial
end
Base.:+(κ::Vector{Float64},φ::Polynomial) = xss(κ,φ) 
Base.:-(κ::Vector{Float64},φ::Polynomial) = xss(κ,-φ) 

function BTnormalformcoefficients(jet, bt, τs; method="orbital", generic_unfolding=true)

# compute characteristic matrices and it's derivatives
Δ, Δ′, Δ′′, Δ′′′, Δ⁴, Δ⁵ = characteristic_matrices(jet.system, bt, τs)
Δs = [Δ′, Δ′′, Δ′′′, Δ⁴, Δ⁵]

# compute eigenvectors
p₁, p₀, q₀, q₁, ψ₁, ψ₀, φ₀, φ₁ = eigenfunctionsBT(Δ, Δs)

m = length(τs)
φ = repeat(bt.coords,1,m)
α = bt.pars

# multi-linear forms at bt point
Ξ(h) = iszero(h) ? repeat(h.coeffs,1,m) : vcat([h(-τ) for τ ∈ τs]...) # this should be fixed in Polynomials
# the problem is that is p = Polynomial([[0.0,0.0]]) then p(something) = 0 and not [0.0,0,0]
B(v₁,v₂)  = jet.D2(φ,α,Ξ(v₁),Ξ(v₂))
A₁(v₁,p₁) = jet.D11(φ,α,Ξ(v₁),p₁)
A₂(v₁,p₁,p₂) = jet.D12(φ,α,Ξ(v₁),p₁,p₂)
B₁(v₁,v₂,p₁) = jet.D21(φ,α,Ξ(v₁),Ξ(v₂),p₁)
C(v₁,v₂,v₃)  = jet.D3(φ,α,Ξ(v₁),Ξ(v₂),Ξ(v₃))
J₁ = jet.D01(φ,α)
J₂(p₁,p₂) = jet.D02(φ,α,p₁,p₂)
J₃(p₁,p₂,p₃) = jet.D03(φ,α,p₁,p₂,p₃)

# define border inverse of characteristic matrix
Δᴵᴺⱽ(y) = ([Δ(0) p₁'; [q₀' 0]]\[y; 0])[1:end-1]

# define bordered inverse of operator A
function Aᴵᴺⱽ(κ,w)
    c₀ = Δᴵᴺⱽ(κ - sum([Δs[i]*c/i for (i,c) in enumerate(w.coeffs)]))
    Polynomial([[c₀]; [c/i for (i,c) in enumerate(w.coeffs)]], :ϑ)
end
Aᴵᴺⱽ(κ) = Polynomial([Δᴵᴺⱽ(κ)], :ϑ)

Aᴵᴺⱽ(rhs::xss) = Aᴵᴺⱽ(rhs.κ, -rhs.φ)

# varify solutions
function check_solution(h, κ)
    if ≈(p₁*κ, 0; atol=1e-12) &&
        ≈(sum(map((δ,c) -> δ*c, [Δ(0), Δs...], h.coeffs)), κ; atol=1e-12)
        true
    else
        false
    end
end

function check_solution(h, κ, w)
    if ≈(p₁*κ - ψ₁(w), 0; atol=1e-12) &&
        ≈(sum(map((δ,c) -> δ*c, [Δ(0), Δs...],h.coeffs)), κ; atol=1e-12) &&
        ≈(derivative(h).coeffs,w.coeffs; atol=1e-12)
        true
    else
        @show p₁*κ - ψ₁(w)
        @show sum(map((δ,c) -> δ*c, [Δ(0), Δs...],h.coeffs)) - κ
        @show derivative(h).coeffs - w.coeffs
        false
    end
end

# critical coefficients
a = 1/2*p₁*B(φ₀, φ₀)
b = p₀*B(φ₀,φ₀) + p₁*B(φ₀,φ₁)

# h2000hat = Aᴵᴺⱽ(B(φ₀,φ₀),2a*φ₁)
h2000hat = Aᴵᴺⱽ(B(φ₀,φ₀) - 2a*φ₁)
h1100hat = Aᴵᴺⱽ(B(φ₀,φ₁),b*φ₁+h2000hat)
ϑ1000 = method == "orbital" ? -1/(12a)*p₁*(3*B(φ₀,h2000hat)+C(φ₀,φ₀,φ₀))+1/2*ψ₁(h1100hat) : 0.0

γ₁ = p₀*B(φ₀,φ₁)-ψ₀(h2000hat)+1/2*p₁*B(φ₁,φ₁)+ϑ1000
γ₂ = 1/(6a)*(p₁*(2B(φ₀,h1100hat)+B(h2000hat,φ₁)+C(φ₀,φ₀,φ₁)) +
				 2a*p₀*B(φ₁,φ₁)-b*p₁*B(φ₁,φ₁) +
				 p₀*(3*B(h2000hat,φ₀)+C(φ₀,φ₀,φ₀))+3γ₁*b +
                 -10a*ψ₀(h1100hat))
h2000 = h2000hat+γ₁*φ₀
h1100 = h1100hat+γ₁*φ₁-ϑ1000*φ₁+γ₂*φ₀
# h0200 = Aᴵᴺⱽ(B(φ₁,φ₁),2h1100);
h0200 = Aᴵᴺⱽ(B(φ₁,φ₁) - 2h1100);
if method == "orbital"
    h3000 = Aᴵᴺⱽ(3*B(h2000,φ₀)+C(φ₀,φ₀,φ₀),6a*(h1100-ϑ1000*φ₁))
else
    d = 1/6*p₁*(3*B(h2000,φ₀)+C(φ₀,φ₀,φ₀)) - a*ψ₁(h1100)
    h3000 = Aᴵᴺⱽ(3*B(h2000,φ₀)+C(φ₀,φ₀,φ₀),6*(a*h1100+d*φ₁))
end
h2100 = Aᴵᴺⱽ(2*B(h1100,φ₀)+B(h2000,φ₁)+C(φ₀,φ₀,φ₁),
             2*a*h0200+2*b*h1100+h3000-2ϑ1000*(b*φ₁-ϑ1000*φ₀+h2000))

if generic_unfolding
    # parameter-dependent linear terms
    # H0010,K10,H0001,K01
    ν = (p₁*J₁)'
    K10hat = 1/(ν'*ν)*ν
    h0010hat = Aᴵᴺⱽ(J₁*K10hat, φ₁)
    K01hat = [0 -1; 1 0]*ν
    h0001hat = Aᴵᴺⱽ(J₁*K01hat)
    
    γ₃ = -(p₁*(B(h0001hat,φ₀)+A₁(φ₀,K01hat)))/(2*a)
    δ₁ = 1/(p₁*(B(h0001hat,φ₁)+A₁(φ₁,K01hat)) + p₀*(B(h0001hat,φ₀)+A₁(φ₀,K01hat))+γ₃*b)
    γ₄ = (ψ₁(h1100)-ϑ1000-p₁*(B(h0010hat,φ₀)+A₁(φ₀,K10hat)))/(2*a)
    δ₂ = -p₁*(B(h0010hat,φ₁)+A₁(φ₁,K10hat)) - γ₄*b + ψ₁(h0200) - p₀*(B(h0010hat,φ₀)+A₁(φ₀,K10hat)) + ψ₀(h1100)
    K01 = δ₁*K01hat
    h0001 = δ₁*(h0001hat + γ₃*φ₀)
    K10 = K10hat+δ₂*K01
    h0010 = h0010hat+δ₂*h0001+γ₄*φ₀

    # h1010, h0100
    h1010 = Aᴵᴺⱽ(B(h0010,φ₀)+A₁(φ₀,K10),h1100-ϑ1000*φ₁)
    h0110 = Aᴵᴺⱽ(B(h0010,φ₁)+A₁(φ₁,K10),h0200+h1010)

    # h1001, h0101, h2001, h1101
    h1001hat = Aᴵᴺⱽ(B(h0001,φ₀)+A₁(φ₀,K01))
    h0101hat = Aᴵᴺⱽ(A₁(φ₁,K01)+B(h0001,φ₁),h1001hat+φ₁)
    ζ₁ = method == "orbital" ? 2a*ψ₁(h0101hat)-p₁*(A₁(h2000,K01)+B(h0001,h2000)+2*B(h1001hat,φ₀) + B₁(φ₀,φ₀,K01)+C(h0001,φ₀,φ₀)) : 0.0
    ζ₂ = ψ₁(b*h0101hat + h1100 - ϑ1000*h1001hat) - ϑ1000 - p₁*(A₁(h1100,K01) + 
                    B(h0001,h1100)+B(h0101hat,φ₀) +
                    B(h1001hat,φ₁)+B₁(φ₀,φ₁,K01)+C(h0001,φ₀,φ₁)) +
                    2*a*ψ₀(h0101hat) - p₀*(A₁(h2000,K01)+B(h0001,h2000)  +
                    2*B(h1001hat,φ₀)+B₁(φ₀,φ₀,K01)+C(h0001,φ₀,φ₀))
    γ₅ = method == "orbital" ? 2*ζ₂/b-ζ₁/(2*a) : ζ₂/b
    ϑ0001 = method == "orbital" ? ζ₁/(2*a)-ζ₂/b : 0.0
    h1001 = h1001hat + γ₅*φ₀
    h0101 = h0101hat + γ₅*φ₁ - ϑ0001*φ₁
    if method == "orbital"
        h2001 = Aᴵᴺⱽ(A₁(h2000,K01)+B(h0001,h2000)+2*B(h1001,φ₀)+B₁(φ₀,φ₀,K01)+C(h0001,φ₀,φ₀), 2a*(h0101 - ϑ0001*φ₁))
    else
        a₁ = 1/2*p₁*(A₁(h2000,K01)+B(h0001,h2000)+2*B(h1001,φ₀)+B₁(φ₀,φ₀,K01)+C(h0001,φ₀,φ₀)) - ψ₁(a*h0101)
        h2001 = Aᴵᴺⱽ(A₁(h2000,K01)+B(h0001,h2000)+2*B(h1001,φ₀)+B₁(φ₀,φ₀,K01)+C(h0001,φ₀,φ₀), 2(a*h0101 + a₁*φ₁))
    end
    h1101 = Aᴵᴺⱽ(A₁(h1100,K01) + B(h0001,h1100) + B(h0101,φ₀) + B(h1001,φ₁) + B₁(φ₀,φ₁,K01) + C(h0001,φ₀,φ₁), 
                 b*h0101+h1100+h2001-ϑ1000*(h1001+φ₁-ϑ0001*φ₀)-ϑ0001*(h2000+b*φ₁-ϑ1000*φ₀))

    # K11, h0011
    K11 = (ψ₁(h0101) - ϑ0001 - p₁*(A₁(h0001,K10)+A₁(h0010,K01)+B(h0001,h0010)+J₂(K01,K10)))*K10
    h0011 = Aᴵᴺⱽ(J₁*K11+A₁(h0001,K10)+A₁(h0010,K01)+B(h0001,h0010)+J₂(K01,K10),h0101-ϑ0001*φ₁)
    hcat(h0011...)

    # K02, h0002, h1002, h0102
    K02hat = -(p₁*(2A₁(h0001,K01) + B(h0001,h0001) + J₂(K01,K01)))*K10
    h0002hat = Aᴵᴺⱽ( J₁*K02hat + 2A₁(h0001,K01) + B(h0001,h0001) + J₂(K01,K01))
    γ₆ = -(1/(2a))*p₁*(2*A₁(h1001,K01)+A₁(φ₀,K02hat)+A₂(φ₀,K01,K01) +
                    B(φ₀,h0002hat)+2B(h0001,h1001)+2B₁(φ₀,h0001,K01) +
                    C(φ₀,h0001,h0001))
    δ₃ = -2ψ₁(ϑ0001*h1001-h0101) -2ϑ0001 -p₁*(2A₁(h0101,K01)+A₁(φ₁,K02hat)+A₂(φ₁,K01,K01) +
                    B(φ₁,h0002hat)+2B(h0001,h0101)+2B₁(φ₁,h0001,K01) +
                    C(φ₁,h0001,h0001)) -
                    p₀*(2A₁(h1001,K01)+A₁(φ₀,K02hat)+A₂(φ₀,K01,K01) + 
                    B(φ₀,h0002hat)+2*B(h0001,h1001)+2B₁(φ₀,h0001,K01) +
                    C(φ₀,h0001,h0001))-γ₆*b
    K02 = K02hat + δ₃*K01
    h0002 = h0002hat + δ₃*h0001 + γ₆*φ₀
    h1002 = Aᴵᴺⱽ(2*A₁(h1001,K01)+A₁(φ₀,K02)+A₂(φ₀,K01,K01)+B(φ₀,h0002)
                    +2*B(h0001,h1001)+2*B₁(φ₀,h0001,K01)+C(φ₀,h0001,h0001))
    h0102 = Aᴵᴺⱽ(2*A₁(h0101,K01)+A₁(φ₁,K02)+A₂(φ₁,K01,K01)+B(φ₁,h0002)
                    +2*B(h0001,h0101)+2*B₁(φ₁,h0001,K01)+C(φ₁,h0001,h0001),
                    2*h0101+h1002-2*ϑ0001*(h1001+φ₁-ϑ0001*φ₀))

    # K03, h0003
    K03 = -p₁*(A₁(h0001,K02)+A₁(h0002,K01)+2*(A₁(h0001,K02)
                    +A₁(h0002,K01))+3*B(h0001,h0002)+3*J₂(K01,K02)
                    +3*A₂(h0001,K01,K01)+3*B₁(h0001,h0001,K01)+C(h0001,h0001,h0001)
                    +J₃(K01,K01,K01))*K10
    h0003 = Aᴵᴺⱽ(J₁*K03+A₁(h0001,K02)+A₁(h0002,K01)+2*(A₁(h0001,K02)
                    +A₁(h0002,K01))+3*B(h0001,h0002)+3*J₂(K01,K02)
                    +3*A₂(h0001,K01,K01)+3*B₁(h0001,h0001,K01)+C(h0001,h0001,h0001)
                    +J₃(K01,K01,K01))

    # Polynomial([[1,1]]) - Polynomial([[1,1]])

    @assert check_solution(h2000, B(φ₀,φ₀),2a*φ₁)
    @assert check_solution(h1100, B(φ₀,φ₁), b*φ₁+h2000-ϑ1000*φ₀)
    @assert check_solution(h0200, B(φ₁,φ₁), 2h1100)
    if method == "orbital"
        @assert check_solution(h3000, 3B(h2000,φ₀) + C(φ₀,φ₀,φ₀), 6a*(h1100 - ϑ1000*φ₁))
    else
        @assert check_solution(h3000, 3B(h2000,φ₀) + C(φ₀,φ₀,φ₀), 6*(a*h1100 + d*φ₁))
    end
    @assert check_solution(h2100, 2B(h1100,φ₀) + B(h2000,φ₁) + C(φ₀,φ₀,φ₁), 2a*h0200 + 2b*h1100 + h3000 - 2ϑ1000*(b*φ₁ - ϑ1000*φ₀ + h2000))

    @assert check_solution(h0001, J₁*K01)
    @assert check_solution(h0010, J₁*K10, φ₁)

    @assert check_solution(h1001, B(h0001,φ₀) + A₁(φ₀,K01))
    @assert check_solution(h0101, B(h0001,φ₁) + A₁(φ₁,K01), h1001 + φ₁ - ϑ0001*φ₀)
    @assert check_solution(h1010, B(h0010,φ₀) + A₁(φ₀,K10), h1100 - ϑ1000*φ₁)
    @assert check_solution(h0110, B(h0010,φ₁) + A₁(φ₁,K10), h0200 + h1010) 

    if method == "orbital"
        @assert check_solution(h2001, A₁(h2000,K01)+B(h0001,h2000)+2*B(h1001,φ₀) +B₁(φ₀,φ₀,K01)+C(h0001,φ₀,φ₀), 2a*(h0101 - ϑ0001*φ₁))
    else
        @assert check_solution(h2001, A₁(h2000,K01)+B(h0001,h2000)+2*B(h1001,φ₀) +B₁(φ₀,φ₀,K01)+C(h0001,φ₀,φ₀), 2*(a*h0101 + a₁*φ₁))
    end
    @assert check_solution(h1101, A₁(h1100,K01) + B(h0001,h1100) + B(h0101,φ₀) + B(h1001,φ₁) + B₁(φ₀,φ₁,K01) + C(h0001,φ₀,φ₁),
                           b*h0101+h1100+h2001-ϑ1000*(h1001+φ₁-ϑ0001*φ₀)-ϑ0001*(h2000+b*φ₁-ϑ1000*φ₀))

    @assert check_solution(h0011,J₁*K11+A₁(h0001,K10)+A₁(h0010,K01)+B(h0001,h0010)+J₂(K01,K10),h0101-ϑ0001*φ₁)

    @assert ≈(p₁*(J₁*K02 + 2A₁(h0001,K01) + B(h0001,h0001) + J₂(K01,K01)), 0.0; atol=5e-14)
    @assert ≈(p₁*(2*A₁(h1001,K01)+A₁(φ₀,K02)+A₂(φ₀,K01,K01)+B(φ₀,h0002) +2*B(h0001,h1001)+2*B₁(φ₀,h0001,K01)+C(φ₀,h0001,h0001)), 0.0; atol=5e-14)
    @assert check_solution(h0102,2*A₁(h0101,K01)+A₁(φ₁,K02)+A₂(φ₁,K01,K01)+B(φ₁,h0002) +2*B(h0001,h0101)+2*B₁(φ₁,h0001,K01)+C(φ₁,h0001,h0001),
                    2*h0101+h1002-2*ϑ0001*(h1001+φ₁-ϑ0001*φ₀))

    @assert ≈(p₁*(J₁*K03+A₁(h0001,K02)+A₁(h0002,K01)+2*(A₁(h0001,K02) +A₁(h0002,K01))+3*B(h0001,h0002)+3*J₂(K01,K02)
                 +3*A₂(h0001,K01,K01)+3*B₁(h0001,h0001,K01)+C(h0001,h0001,h0001) +J₃(K01,K01,K01)), 0.0; atol=5e-14)

    (   a=a,
        b=b,
        ϑ1000 = ϑ1000,
        ϑ0001 = ϑ0001,
        K10 = K10,
        K01 = K01,
        K02 = K02,
        K11 = K11,
        K03 = K03,
        q₀ = q₀,
        q₁ = q₁,
        h0010 = h0010,
        h0001 = h0001,
        h2000 = h2000,
        h1100 = h1100,
        h0200 = h0200,
        h1010 = h1010,
        h1001 = h1001,
        h0110 = h0110,
        h0101 = h0101,
        h0002 = h0002,
        h0011 = h0011,
        h3000 = h3000,
        h2100 = h2100,
        h1101 = h1101,
        h2001 = h2001,
        h0003 = h0003,
        h1002 = h1002,
        h0102 = h0102)
else
    e1 = [1;0]
    e2 = [0;1]
    M₀ = [        p₁*A₁(φ₀,e1)                     p₁*A₁(φ₀,e2) 
     (p₀*A₁(φ₀,e1) + p₁*A₁(φ₁,e1))     (p₀*A₁(φ₀,e2) + p₁*A₁(φ₁,e2)) ]
    Id = [1 0; 0 1]
    δ1, δ2, δ3, δ4 = M₀\Id

    K10 = δ1*e1 + δ2*e2 
    K01 = δ3*e1 + δ4*e2 

    h1010hat = Aᴵᴺⱽ(A₁(φ₀,K10), φ₁) 
    h1001hat = Aᴵᴺⱽ(A₁(φ₀,K01)) 

    h0110hat = Aᴵᴺⱽ(A₁(φ₁,K10),h1010hat)
    h0101hat = Aᴵᴺⱽ(A₁(φ₁,K01),h1001hat + φ₁)

    M₁ = [2a 4a 
          b  b]

    ζ₁ = -p₁*(A₁(h2000,K10) + 2*B(h1010hat,φ₀) + B₁(φ₀,φ₀,K10)) + 2*ψ₁(a*h0110hat + h1100) - 2*ϑ1000
    ζ₂ = -p₀*(A₁(h2000,K10) + 2*B(h1010hat,φ₀) + B₁(φ₀,φ₀,K10)) + 2*ψ₀(a*h0110hat + h1100) -
            p₁*(A₁(h1100,K10) + B(h0110hat,φ₀) + B(h1010hat,φ₁) + B₁(φ₀,φ₁,K10)) + 
            ψ₁(b*h0110hat + h0200 - ϑ1000*h1010hat)
    γ₃, ϑ0010 = M₁\[ζ₁; ζ₂]

    ζ₃ = -p₁*(A₁(h2000,K01) + 2*B(h1001hat,φ₀) + B₁(φ₀,φ₀,K01)) + 2*a*ψ₁(h0101hat)
    ζ₄ =  p₀*(A₁(h2000,K01) + 2*B(h1001hat,φ₀) + B₁(φ₀,φ₀,K01)) + 2*a*ψ₀(h0101hat) - 
            p₁*(A₁(h1100,K01) + B(h0101hat,φ₀) + B(h1001hat,φ₁) + B₁(φ₀,φ₁,K01)) + 
            ψ₁(b*h0101hat + h1100 - ϑ1000*h1001hat) + ϑ1000 
    γ₄, ϑ0001 = M₁\[ζ₃; ζ₄]

    γ₅ = -p₁*(2*A₁(h1001hat,K01) + A₂(φ₀,K01,K01))
    γ₆ = -p₀*(2*A₁(h1001hat,K01) + A₂(φ₀,K01,K01)) -p₁*(2*A₁(h0101hat,K01) + A₂(φ₁,K01,K01)) + 2*ψ₁(h0101hat) - 2*ϑ0001

    γ₇ = -p₁*(A₁(h1001hat,K10) + A₁(h1010hat,K01) + A₂(φ₀,K01,K10)) + ψ₁(h0101hat) + - 2*ϑ0001 
    γ₈ = -p₀*(A₁(h1001hat,K10) + A₁(h1010hat,K01) + A₂(φ₀,K01,K10)) -
          p₁*(A₁(h0101hat,K10) + A₁(h0110hat,K01) + A₂(φ₁,K01,K10)) - ϑ0010 + ψ₀(h0101hat) + ψ₁(h0110hat)

    γ₉  = -p₁*(2*A₁(h1010hat,K10) + A₂(φ₀,K10,K10)) - 4*ϑ0010 + 2*ψ₁(h0110hat)
    γ₁₀ = -p₀*(2*A₁(h1010hat,K10) + A₂(φ₀,K10,K10)) - p₁*(2*A₁(h0110hat,K10) + A₂(φ₁,K10,K10)) + 2*ψ₀(h0110hat)

    h1010 = h1010hat + γ₃*φ₀
    h1001 = h1001hat + γ₄*φ₀
    h0110 = h0110hat + γ₃*φ₁ - ϑ0010*φ₁
    h0101 = h0101hat + γ₄*φ₁ - ϑ0001*φ₁

    # @assert check_solution(h1010, A₁(φ₀,K10), φ₁)
    # @assert check_solution(h1001, A₁(φ₀,K01))
    # @assert check_solution(h0110, A₁(φ₁,K10), h1010 - ϑ0010*φ₀) 
    # @assert check_solution(h0101, A₁(φ₁,K01), h1001 + φ₁ - ϑ0001*φ₀)

    K02 = γ₅*K10 + γ₆*K01
    K11 = γ₇*K10 + γ₈*K01
    K20 = γ₉*K10 + γ₁₀*K01

    # solve the equations
    h2010 = Aᴵᴺⱽ(A₁(h2000,K10) + 2*B(h1010,φ₀) + B₁(φ₀,φ₀,K10), 2*a*h0110 + 2*h1100 - ϑ0010*2a*φ₁ - 2*ϑ1000*φ₁)
    h1110 = Aᴵᴺⱽ(A₁(h1100,K10) + B(h0110,φ₀) + B(h1010,φ₁) + B₁(φ₀,φ₁,K10), b*h0110 + h0200 + h2010 - ϑ1000*(h1010 - ϑ0010*φ₀) - ϑ0010*(b*φ₁ - ϑ1000*φ₀ + h2000))

    h2001 = Aᴵᴺⱽ(A₁(h2000,K01) + 2*B(h1001,φ₀) + B₁(φ₀,φ₀,K01), 2*a*h0101 - ϑ0001*2a*φ₁)
    h1101 = Aᴵᴺⱽ(A₁(h1100,K01) + B(h0101,φ₀) + B(h1001,φ₁) + B₁(φ₀,φ₁,K01), b*h0101 + h1100 + h2001 - ϑ1000*(h1001 + φ₁ - ϑ0001*φ₀) - ϑ0001*(b*φ₁ - ϑ1000*φ₀ + h2000))

    h1002 = Aᴵᴺⱽ( 2*A₁(h1001,K01) + A₁(φ₀,K02) + A₂(φ₀,K01,K01))
    h0102 = Aᴵᴺⱽ(2*A₁(h0101,K01) + A₁(φ₁,K02) + A₂(φ₁,K01,K01), 2*h0101 + h1002 - 2*ϑ0001*(h1001 + φ₁ - ϑ0001*φ₀))

    h1020 = Aᴵᴺⱽ(2*A₁(h1010,K10) + A₁(φ₀,K20) + A₂(φ₀,K10,K10), 2*h0110 - 2*ϑ0010*φ₁)
    h0120 = Aᴵᴺⱽ(2*A₁(h0110,K10) + A₁(φ₁,K20) + A₂(φ₁,K10,K10), h1020 - 2*ϑ0010*(h1010 - ϑ0010*φ₀))

    h1011 = Aᴵᴺⱽ(A₁(h1001,K10) + A₁(h1010,K01) + A₁(φ₀,K11) + A₂(φ₀,K01,K10), h0101 - ϑ0001*φ₁)
    h0111 = Aᴵᴺⱽ(A₁(h0101,K10) + A₁(h0110,K01) + A₁(φ₁,K11) + A₂(φ₁,K01,K10), h0110 + h1011 - ϑ0010*(h1001 + φ₁ - ϑ0001*φ₀) - ϑ0001*(h1010 - ϑ0010*φ₀))

    (a = a, 
     b = b,
     ϑ1000 = ϑ1000,
     ϑ0010 = ϑ0010,
     ϑ0001 = ϑ0001,
     φ₀    = φ₀,
     φ₁    = φ₁,
     h2000 = h2000,
     h1100 = h1100,
     h0200 = h0200,
     h3000 = h3000,
     h2100 = h2100,
     K10   = K10,
     K01   = K01,
     K02   = K02,
     K11   = K11,
     K20   = K20,
     h1010 = h1010,
     h1001 = h1001,
     h0110 = h0110,
     h0101 = h0101,
     h2010 = h2010,
     h1110 = h1110,
     h2001 = h2001,
     h1101 = h1101,
     h1002 = h1002,
     h0102 = h0102,
     h1020 = h1020,
     h0120 = h0120,
     h1011 = h1011,
     h0111 = h0111)


end



end
