function normalform(jet, hopf::GenHopf, τs)

    m = length(τs)
    φ = repeat(hopf.coords,1,m)
    α = hopf.parameters

    λ = hopf.ω*im
    Δ(λ) = jet.Δ(φ,α,λ)
    Δ′(λ)= jet.Δ′(φ,α,λ)
    Δ′′(λ)= jet.Δ′′(φ,α,λ)

    _, s, V = svd(Δ(λ))
    indxmin = last(findmin(s))
    q = V[:, indxmin]

    _, s, V = svd(transpose(Δ(λ)))
    indxmin = last(findmin(s))
    p = V[:, indxmin]

    # normalize
    p /=  transpose(p)*(Δ′(λ)*q)

    # define border inverse of characteristic matrix
    Δᴵᴺⱽ(λ,y) = ([Δ(λ) q; [p' 0]]\[y; 0])[1:end-1]
    function Aᴵᴺⱽ(λ,η,κ) 
        ξ = Δᴵᴺⱽ(λ,η + κ*Δ′(λ)*q)
        γ = first(transpose(p)*(-Δ′(λ)*ξ + 0.5*κ*Δ′′(λ)*q))
        θ -> exp(λ*θ)*(ξ + γ*q - κ*θ*q)
    end

    # multi-linear forms at bt point
    Ξ(h) = vcat([h(-τ) for τ ∈ τs]...)
    B(v₁,v₂)  = jet.D2(φ,α,Ξ(v₁),Ξ(v₂))
    C(v₁,v₂,v₃)  = jet.D3(φ,α,Ξ(v₁),Ξ(v₂),Ξ(v₃))
    D(v₁,v₂,v₃,v₄)  = jet.D4(φ,α,Ξ(v₁),Ξ(v₂),Ξ(v₃),Ξ(v₄))
    E(v₁,v₂,v₃,v₄,v₅)  = jet.D5(φ,α,Ξ(v₁),Ξ(v₂),Ξ(v₃),Ξ(v₄),Ξ(v₅))
    J₁ = jet.D01(φ,α)
    A₁(v₁,p₁)  = jet.D11(φ,α,Ξ(v₁),p₁)
    B₁(v₁,v₂,p₁)  = jet.D21(φ,α,Ξ(v₁),Ξ(v₂),p₁)
    C₁(v₁,v₂,v₃,p₁)  = jet.D31(φ,α,Ξ(v₁),Ξ(v₂),Ξ(v₃),p₁)

    ϕ(θ) = exp(λ*θ)*q
    h2000(θ) = exp(2.0*λ*θ)*(Δ(2.0*λ)\B(ϕ,ϕ))
    h1100(_) = Δ(0.0)\B(ϕ,conj∘ϕ)

    c₁ = first((1/2)*transpose(p)*(B(conj∘ϕ,h2000) + 2*B(ϕ,h1100) + C(ϕ,ϕ,conj∘ϕ)))
    ℓ₁ = real(c₁)/hopf.ω

    h3000(θ) = exp(3*λ*θ)*(Δ(3*λ)\(3*B(ϕ,h2000) + C(ϕ,ϕ,ϕ)))
    h2100 = Aᴵᴺⱽ(λ,B(conj∘ϕ,h2000) + 2*B(ϕ,h1100) + C(ϕ,ϕ,conj∘ϕ),-2c₁)

    h2200(_) = Δ′(0.0) \ (2B(conj∘ϕ,h2100) + 2B(ϕ,conj∘h2100) + B(conj∘h2000, h2000) + 2B(h1100,h1100) + C(ϕ,ϕ,conj∘h2000) + 4C(ϕ,conj∘ϕ,h1100) + C(conj∘ϕ,conj∘ϕ,h2000) + D(ϕ,ϕ,conj∘ϕ,conj∘ϕ))

    h3100(θ) = exp(2*λ*θ)*(Δ(2*λ)\(B(conj∘ϕ,h3000) + 3B(ϕ,h2100) + 3B(h1100,h2000) + 3C(ϕ,conj∘ϕ,h2000) + 3C(ϕ,ϕ,h1100) + D(ϕ,ϕ,ϕ,conj∘ϕ))) - 6c₁*(Δ(2λ)\(Δ′(2λ) - θ*Δ(2λ)))*h2000(θ)

    c₂ = 1/12*transpose(p)*(2B(conj∘ϕ,h3100) + 3B(ϕ,h2200) + B(conj∘h2000,h3000) + 6B(h1100,h2100) + 3B(conj∘h2100,h2000)  +  
        6C(conj∘ϕ,h2000,h1100) + 6C(ϕ,conj∘ϕ,h2100)  + C(conj∘ϕ,conj∘ϕ,h3000) + 3C(ϕ,ϕ,conj∘h2100) +  3C(ϕ,h2000,conj∘h2000) + 
        6C(ϕ,h1100,h1100) + 6D(ϕ,ϕ,conj∘ϕ,h1100) + 3D(ϕ,conj∘ϕ,conj∘ϕ,h2000) +
        D(ϕ,ϕ,ϕ,conj∘h2000) + E(ϕ,ϕ,ϕ,conj∘ϕ,conj∘ϕ))
    ℓ₂ = real(c₂)/hopf.ω

    # parameter-related normal form coefficients
    h0010(_) = Δ(0.0)\(J₁*[1.0; 0.0])
    h0001(_) = Δ(0.0)\(J₁*[0.0; 1.0])

    γ110 = first(transpose(p)*(A₁(ϕ,[1.0; 0.0]) + B(ϕ,h0010)))
    γ101 = first(transpose(p)*(A₁(ϕ,[0.0; 1.0]) + B(ϕ,h0001)))

    h1010 = Aᴵᴺⱽ(λ,A₁(ϕ,[1.0; 0.0]) + B(ϕ,h0010),-γ110)
    h1001 = Aᴵᴺⱽ(λ,A₁(ϕ,[0.0; 1.0]) + B(ϕ,h0001),-γ101)

    h2010(θ) = exp(2λ*θ)*Δ(2λ)\(A₁(h2000,[1.0; 0.0]) + 2B(ϕ,h1010) + B(h2000,h0010) + B₁(ϕ,ϕ,[1.0; 0.0]) + C(ϕ,ϕ,h0010)) - 2γ110*Δ(2λ)\(Δ′(2λ) - θ*Δ(2λ))*h2000(θ)
    h2001(θ) = exp(2λ*θ)*Δ(2λ)\(A₁(h2000,[0.0; 1.0]) + 2B(ϕ,h1001) + B(h2000,h0001) + B₁(ϕ,ϕ,[0.0; 1.0]) + C(ϕ,ϕ,h0001)) - 2γ101*Δ(2λ)\(Δ′(2λ) - θ*Δ(2λ))*h2000(θ)

    h1101(θ) = Δ(0.0)\(A₁(h1100,[1.0; 0.0]) + 2real(B(conj∘ϕ,h1010)) + B(h1100,h0010) + B₁(ϕ,conj∘ϕ,[1.0; 0.0]) + C(ϕ,conj∘ϕ,h0010)) - 2*real(γ110)*Δ(0.0)\(Δ′(0.0) - θ*Δ(0.0))*h1100(θ)
    h1110(θ) = Δ(0.0)\(A₁(h1100,[0.0; 1.0]) + 2real(B(conj∘ϕ,h1001)) + B(h1100,h0001) + B₁(ϕ,conj∘ϕ,[0.0; 1.0]) + C(ϕ,conj∘ϕ,h0001)) - 2*real(γ101)*Δ(0.0)\(Δ′(0.0) - θ*Δ(0.0))*h1100(θ)

    γ210 = 0.5*transpose(p) * (A₁(h2100,[1.0; 0.0]) + B(conj∘ϕ,h2010) + 2B(ϕ,h1110) + B(h2100,h0010) + B(h2000,conj∘h1010) + 2B(h1100,h1010) + B₁(h2000,conj∘ϕ,[1.0; 0.0]) + 2B₁(ϕ,h1100,[1.0; 0.0]) + 2C(ϕ,conj∘ϕ,h1010) + C(h2000,conj∘ϕ,h0010) + C(ϕ,ϕ,conj∘h1010) + 2C(ϕ,h1100,h0010) + C₁(ϕ,ϕ,conj∘ϕ,[1.0; 0.0]) + D(ϕ,ϕ,conj∘ϕ,h0010)) |> first
    γ201 = 0.5*transpose(p) * (A₁(h2100,[0.0; 1.0]) + B(conj∘ϕ,h2001) + 2B(ϕ,h1101) + B(h2100,h0001) + B(h2000,conj∘h1001) + 2B(h1100,h1001) + B₁(h2000,conj∘ϕ,[0.0; 1.0]) + 2B₁(ϕ,h1100,[0.0; 1.0]) + 2C(ϕ,conj∘ϕ,h1001) + C(h2000,conj∘ϕ,h0001) + C(ϕ,ϕ,conj∘h1001) + 2C(ϕ,h1100,h0001) + C₁(ϕ,ϕ,conj∘ϕ,[0.0; 1.0]) + D(ϕ,ϕ,conj∘ϕ,h0001)) |> first

    
    (;γ110,γ101,γ210,γ201,c₁,c₂,ℓ₁,ℓ₂,q,h2000,h1100,h2010,h2001,h1101,h1110,h2100,h2200,h3100,h1010,h1001,h0010,h0001)
end
